In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
mylist=[1,2,3,4,5]
mylist2=['a','b','c','d','e']
ser1=pd.Series(mylist2,mylist)

In [4]:
mylist3=['a','b','r','d','e']
ser2=pd.Series(mylist3,mylist)

In [5]:
ser1+ser2

1    aa
2    bb
3    cr
4    dd
5    ee
dtype: object

DataFrame

In [9]:
from numpy.random import randn

In [9]:
np.random.seed(101)

In [11]:
df=pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [12]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [35]:
df['new']=[1,2,3,4,4]

In [18]:
df

          w         x         y         z  new
a  2.706850  0.628133  0.907969  0.503826    1
b  0.651118 -0.319318 -0.848077  0.605965    2
c -2.018168  0.740122  0.528813 -0.589001    3
d  0.188695 -0.758872 -0.933237  0.955057    4
e  0.190794  1.978757  2.605967  0.683509    4

In [24]:
df.drop('e',axis=1)

          w         x         y         z  new
a  2.706850  0.628133  0.907969  0.503826    1
b  0.651118 -0.319318 -0.848077  0.605965    2
c -2.018168  0.740122  0.528813 -0.589001    3
d  0.188695 -0.758872 -0.933237  0.955057    4
e  0.190794  1.978757  2.605967  0.683509    4

In [22]:
df['e']=[1,2,3,4,5]

In [25]:
df

          w         x         y         z  new  e
a  2.706850  0.628133  0.907969  0.503826    1  1
b  0.651118 -0.319318 -0.848077  0.605965    2  2
c -2.018168  0.740122  0.528813 -0.589001    3  3
d  0.188695 -0.758872 -0.933237  0.955057    4  4
e  0.190794  1.978757  2.605967  0.683509    4  5

In [26]:
df.drop('e',axis=1)

          w         x         y         z  new
a  2.706850  0.628133  0.907969  0.503826    1
b  0.651118 -0.319318 -0.848077  0.605965    2
c -2.018168  0.740122  0.528813 -0.589001    3
d  0.188695 -0.758872 -0.933237  0.955057    4
e  0.190794  1.978757  2.605967  0.683509    4

In [27]:
df.shape

(5, 6)

In [36]:
df.drop('new',axis=1,inplace=True)

In [37]:
df.shape

(5, 5)

In [38]:
df

          w         x         y         z  e
a  2.706850  0.628133  0.907969  0.503826  1
b  0.651118 -0.319318 -0.848077  0.605965  2
c -2.018168  0.740122  0.528813 -0.589001  3
d  0.188695 -0.758872 -0.933237  0.955057  4
e  0.190794  1.978757  2.605967  0.683509  5

In [12]:
outside=['g1','g2','g1','g2','g1','g2']
inside=[1,2,3,1,2,3]
hire_index=list(zip(outside,inside))
hire_index=pd.MultiIndex.from_tuples(hire_index)
hire_index

MultiIndex([('g1', 1),
            ('g2', 2),
            ('g1', 3),
            ('g2', 1),
            ('g1', 2),
            ('g2', 3)],
           )

In [13]:
df=pd.DataFrame(randn(6,2),hire_index,['a','b'])

In [14]:
df

             a         b
g1 1  0.503305 -0.441487
g2 2 -1.090739 -0.517859
g1 3  0.238524  0.092922
g2 1  1.810030 -0.206151
g1 2  0.660778 -1.236658
g2 3 -0.520905 -0.455989

In [15]:
df.loc['g1']

          a         b
1  0.503305 -0.441487
3  0.238524  0.092922
2  0.660778 -1.236658

In [16]:
df.loc['g1'].loc[1]

a    0.503305
b   -0.441487
Name: 1, dtype: float64

In [17]:
df.index.names=['groups','number']

In [18]:
df

                      a         b
groups number
g1     1       0.503305 -0.441487
g2     2      -1.090739 -0.517859
g1     3       0.238524  0.092922
g2     1       1.810030 -0.206151
g1     2       0.660778 -1.236658
g2     3      -0.520905 -0.455989

In [19]:
df.loc['g2'].loc[2]['b']

-0.5178594283992228

In [21]:
#cross section it directly retrieve back the  data what we want
df.xs('g2')

               a         b
number
2      -1.090739 -0.517859
1       1.810030 -0.206151
3      -0.520905 -0.455989

In [23]:
df.xs(1,level='number')

               a         b
groups
g1      0.503305 -0.441487
g2      1.810030 -0.206151

In [3]:
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'person':['sam','charlie','amy','vanessa','carl','sarah'],
     'Sales':[200,120,300,124,243,350]}

In [4]:
df=pd.DataFrame(data)

In [5]:
df

  Company   person  Sales
0    GOOG      sam    200
1    GOOG  charlie    120
2    MSFT      amy    300
3    MSFT  vanessa    124
4      FB     carl    243
5      FB    sarah    350

In [9]:
byComp=df.groupby('Company')

In [11]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     212.0

In [12]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       424

In [13]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     124.450793

In [14]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [15]:
byComp.max()

          person  Sales
Company
FB         sarah    350
GOOG         sam    200
MSFT     vanessa    300

In [16]:
byComp.max().loc['FB']

person    sarah
Sales       350
Name: FB, dtype: object

In [24]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  212.0  124.450793  124.0  168.00  212.0  256.00  300.0

In [21]:
df.person

0        sam
1    charlie
2        amy
3    vanessa
4       carl
5      sarah
Name: person, dtype: object

In [25]:
df.groupby('Company').max()

          person  Sales
Company
FB         sarah    350
GOOG         sam    200
MSFT     vanessa    300

# Merging joining and concatenating

In [28]:
df1=pd.DataFrame({'A': ['A0','A1','A2','A3'],
                 'B':['B0','B2','B3','B4'],
                 'C':['C0','C1','C3','C4'],
                 'D':['D0','D1','D2','D3']},
            index=[0,1,2,3])

In [29]:
df2=pd.DataFrame({'A': ['A4','A5','A6','A7'],
                 'B':['B4','B5','B6','B7'],
                 'C':['C4','C5','C6','C7'],
                 'D':['D4','D5','D6','D7']},
            index=[4,5,6,7])

In [30]:
df3=pd.DataFrame({'A': ['A8','A9','A10','A11'],
                 'B':['B8','B9','B10','B11'],
                 'C':['C8','C9','C10','C11'],
                 'D':['D8','D9','D10','D11']},
            index=[8,9,10,11])

In [33]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [37]:
pd.concat([df1,df2,df3],axis=0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B2   C1   D1
2    A2   B3   C3   D2
3    A3   B4   C4   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [38]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B2   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B3   C3   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B4   C4   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [41]:
right=pd.DataFrame({'KEY': ['K0','K1','K2','K3'],
                 'B':['B0','B2','B3','B4'],
                 'C':['C0','C1','C3','C4']})

In [46]:
left=pd.DataFrame({'KEY': ['K0','K1','K2','K3'],
                 'D':['D0','D2','D3','D4'],
                 'E':['E0','E1','E3','E4'],
                 'F':['F0','F1','F2','F3']})
left

  KEY   D   E   F
0  K0  D0  E0  F0
1  K1  D2  E1  F1
2  K2  D3  E3  F2
3  K3  D4  E4  F3

In [44]:
#Using common element merging two dataframes
pd.merge(right,left,how='inner',on='KEY')

  KEY   B   C   D   E   F
0  K0  B0  C0  D0  E0  F0
1  K1  B2  C1  D2  E1  F1
2  K2  B3  C3  D3  E3  F2
3  K3  B4  C4  D4  E4  F3

In [53]:
left=pd.DataFrame({'KEY': ['K0','K1','K2','K3'],
                 'B':['D0','D2','D3','D4'],
                 'C':['E0','E1','E3','E4']},
                 index=[1,2,3,4])

In [58]:
right=pd.DataFrame({'KEY2': ['K0','K1','K2','K3'],
                 'D':['B0','B2','B3','B4'],
                 'E':['C0','C1','C3','C4']},
                  index=[1,2,3,4])

In [59]:
left.join(right)

  KEY   B   C KEY2   D   E
1  K0  D0  E0   K0  B0  C0
2  K1  D2  E1   K1  B2  C1
3  K2  D3  E3   K2  B3  C3
4  K3  D4  E4   K3  B4  C4

In [67]:
left=pd.DataFrame({'A':['a1','a2','a3'],
                  'B':['b1','b2','b3']},
                 index=['k1','k2','k3'])
left

     A   B
k1  a1  b1
k2  a2  b2
k3  a3  b3

In [70]:
right=pd.DataFrame({'C':['a1','a2','a4'],
                  'D':['b1','b2','b4']},
                 index=['k1','k3','k4'])
right

     C   D
k1  a1  b1
k3  a2  b2
k4  a4  b4

In [69]:
right.join(left)

     C   D    A    B
k1  a1  b1   a1   b1
k3  a2  b2   a3   b3
k4  a4  b4  NaN  NaN

In [3]:
df=pd.DataFrame({'col1':[1,2,3],
                'col2':[444,555,666],
                'col3':['abc','def','ghi']})

In [4]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi

In [7]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [8]:
df['col2'].value_counts()

555    1
666    1
444    1
Name: col2, dtype: int64

In [12]:
def times2(x):
    return x*2

In [13]:
df['col1'].apply(times2)

0    2
1    4
2    6
Name: col1, dtype: int64

In [14]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi

In [16]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [17]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [18]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi

In [21]:
df.drop(2,inplace=True)

In [22]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [23]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [24]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False

In [25]:
df=pd.DataFrame({'A':['foo','foo','foo','bar','bar','bar'],
                'B':['one','one','two','two','one','one'],
                'C':['x','y','x','y','x','y'],
                'D':[1,3,2,5,4,1]})

In [26]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [28]:
#pivot table
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN